# Pandas introduction : 
pandas basically num py ki hi aek libraray hai jis me kuch zyada advaatages hain aur ye back end pr numpy ki library hi ko use krr rahi hoti for multi dimentional array but is ka sb se bara benefit yeh hai ke ye data ko data dataframes me represen krti hai jis me ap column ki heading bbhi define kr skty hai aur har row ke lye label bhi define kr skty hain .

In [1]:
#when we work on ai projects we need to manage multidimensional data organized and well managed data is a req for all steps like training , validation testing and prediction .

In [2]:
import pandas as pd

# Series object:
part:1

In [3]:
obj = pd.Series([4,7,-5,3])
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
#pandas series has two things in one object :
#1 : Values 
#2: index
print(obj.values)

[ 4  7 -5  3]

In [5]:
print(obj.index) #startinig from zero and ending on 4 and increment by 1

RangeIndex(start=0, stop=4, step=1)

In [6]:
#part :02

In [7]:
sales = pd.Series([100,200,300,400] , index = ["jan","frb","mar","apr"])

In [8]:
print(sales)

jan    100
frb    200
mar    300
apr    400
dtype: int64

In [9]:
#part : 03

In [10]:
print(sales.values)

[100 200 300 400]

In [11]:
print(sales.index) #when pandas feel a complex data to it declared this data as "object" data type .object : is a datatype in which u can store any kind of data .i.e : float int string whatwver u want .

Index(['jan', 'frb', 'mar', 'apr'], dtype='object')

In [12]:
#if i want to declare name :
sales = pd.Series([100,200,300,400] , index = ["jan","frb","mar","apr"],name = "4 month sales")

In [13]:
print(sales)

jan    100
frb    200
mar    300
apr    400
Name: 4 month sales, dtype: int64

In [14]:
#part :"04":

In [15]:
#we can declare series name too , this name would help us when we would merge our series with data frame it would make this name :
#as a column header of the data frame.
#ex 01 : create a canteen record of a week that how many sandwitches are sold in a week .
canteen_data = pd.Series([150,200,100,400,100,150,170],index = ["mon","tue","wed","thu","fri","sat","sun"],name = "sandwiches sold price")

In [16]:
print(canteen_data)

mon    150
tue    200
wed    100
thu    400
fri    100
sat    150
sun    170
Name: sandwiches sold price, dtype: int64

In [17]:
print(canteen_data[1])

200

In [18]:
print(canteen_data["mon"]) #from index

150

In [19]:
#for extracting multiple value from a series :
print(canteen_data[ [3,5,6]])

thu    400
sat    150
sun    170
Name: sandwiches sold price, dtype: int64

In [20]:
#u had to pass two large bracket and enclose the values in the form of an arrau had to give array notation .
print(canteen_data[["mon","wed","sun"]])

mon    150
wed    100
sun    170
Name: sandwiches sold price, dtype: int64

In [21]:
print(canteen_data >100) #return boolean values .

mon     True
tue     True
wed    False
thu     True
fri    False
sat     True
sun     True
Name: sandwiches sold price, dtype: bool

In [22]:
#and for getting original values use :
print(canteen_data[canteen_data >150])

tue    200
thu    400
sun    170
Name: sandwiches sold price, dtype: int64

In [23]:
canteen_data * 3

mon     450
tue     600
wed     300
thu    1200
fri     300
sat     450
sun     510
Name: sandwiches sold price, dtype: int64

In [24]:
print(canteen_data)

mon    150
tue    200
wed    100
thu    400
fri    100
sat    150
sun    170
Name: sandwiches sold price, dtype: int64

In [25]:
canteen_data = canteen_data * 3

In [26]:
canteen_data

mon     450
tue     600
wed     300
thu    1200
fri     300
sat     450
sun     510
Name: sandwiches sold price, dtype: int64

In [27]:
canteen_data = canteen_data / 3 #it return float values

In [28]:
canteen_data

mon    150.0
tue    200.0
wed    100.0
thu    400.0
fri    100.0
sat    150.0
sun    170.0
Name: sandwiches sold price, dtype: float64

In [29]:
#if i want to check a index is present in the series or not:
#we had use this in func before in python to check that something is present in the list .
"mon" in canteen_data

True

In [30]:
150.0 in canteen_data # u can check it only by using index not value

False

In [31]:
import numpy as np

In [32]:
arr = np.array([1,22,333,444,55,66])
arr_index = np.array(["a","b","c","d","e","f"])

In [33]:
#for converting a data into series :
ser = pd.Series(arr,arr_index)

In [34]:
ser

a      1
b     22
c    333
d    444
e     55
f     66
dtype: int32

In [35]:
#we can get data from a dic too :
dic = {"sindh" : 250000,"balochistan" : 12000,"punjab":40000,"kpk":45000}
dic

{'sindh': 250000, 'balochistan': 12000, 'punjab': 40000, 'kpk': 45000}

In [36]:
tax_paid = pd.Series(dic) #it would use key as index of the series and values as values

In [37]:
tax_paid

sindh          250000
balochistan     12000
punjab          40000
kpk             45000
dtype: int64

In [38]:
tax_paid.index

Index(['sindh', 'balochistan', 'punjab', 'kpk'], dtype='object')

In [39]:
#if u change the position of an index it value will not be changed like :
#if i bring punjab on 0 index it value still remain the same 
tax_paid = pd.Series(dic, index = ["punjab","balochistan","sindh","kpk"])

In [40]:
tax_paid # u can see punjab is still 40000 .

punjab          40000
balochistan     12000
sindh          250000
kpk             45000
dtype: int64

# **u can get data into series from : **
    *numpy array
    *list
    *and dictionary

In [41]:
#if a value is missing(null) in a data so can we find that value :
#we use pd.isnull(sername)

In [42]:
tax_paid = pd.Series(dic, index = ["punjab","balochistan","sindh","kpk" ,"gilgit"])

In [43]:
tax_paid

punjab          40000.0
balochistan     12000.0
sindh          250000.0
kpk             45000.0
gilgit              NaN
dtype: float64

In [44]:
pd.isnull(tax_paid) #where it would be null it would return true value

punjab         False
balochistan    False
sindh          False
kpk            False
gilgit          True
dtype: bool

In [45]:
pd.isnull(tax_paid)

punjab         False
balochistan    False
sindh          False
kpk            False
gilgit          True
dtype: bool

In [46]:
pd.isnull(tax_paid)

punjab         False
balochistan    False
sindh          False
kpk            False
gilgit          True
dtype: bool

In [47]:
#null value means that this index value is not present in the series 
#but remember null and empty or two diff things for ex:
#if a string has no value to it means its empty but not null .
#null means that id does not exist at all .

In [48]:
pd.isnull(tax_paid) # is a function of series.

punjab         False
balochistan    False
sindh          False
kpk            False
gilgit          True
dtype: bool

In [49]:
tax_paid.isnull() #is a method of series . both things are valid .

punjab         False
balochistan    False
sindh          False
kpk            False
gilgit          True
dtype: bool

In [50]:
#we can name values : ser.name = "name of values"
#we can also name index : ser.index.name = "name of index"
tax_paid.name ="provinces_tax"
tax_paid.index.name = "provinces_name "

In [51]:
tax_paid

provinces_name
punjab          40000.0
balochistan     12000.0
sindh          250000.0
kpk             45000.0
gilgit              NaN
Name: provinces_tax, dtype: float64

In [52]:
tax_paid.index

Index(['punjab', 'balochistan', 'sindh', 'kpk', 'gilgit'], dtype='object', name='provinces_name ')

In [53]:
#u can also change the values of series and its indexes also
tax_paid.index = ["pun","bal","sin","kpk" ,"gil"]

In [54]:
tax_paid

pun     40000.0
bal     12000.0
sin    250000.0
kpk     45000.0
gil         NaN
Name: provinces_tax, dtype: float64

In [55]:
#remeber one thing : null != 0 , means if zero is present then it is not  null at all
#naming series is important because later we would combine it with data frame and it would help us there
#because bascially DATAFRAME is a combination of multilple Series...

# DATA FRAME :
As in series we store a single dimension data but when we had to store the data of multi dimension the we use dataframe to store that type of data .
we had more than one col in a dataframe but in series we had only one column .
in pandas we had to store the index .
series+series = dataframe .(but the index of the series should be same for both )

In [56]:
import pandas as pd

In [57]:
#merging two series into a data frame:
apples = pd.Series([3,2,0,1])
oranges = pd.Series([4,5,1,2])
print(apples,oranges)

0    3
1    2
2    0
3    1
dtype: int64 0    4
1    5
2    1
3    2
dtype: int64

In [58]:
data = {"apples" : apples ,"oranges" : oranges}
fruits = pd.DataFrame(data)
fruits2 = pd.DataFrame(apples,oranges)
print(fruits2)
print(fruits)

     0
4  NaN
5  NaN
1  2.0
2  0.0
   apples  oranges
0       3        4
1       2        5
2       0        1
3       1        2

In [59]:
#u can also change indexes of pandas too . but remember index and values should be equal
data1= {'state': ['karachi','islamabad','kashmir','sialkot'],
        'POP' : [100,200,300,400],
        }
dataframe = pd.DataFrame(data1,index = ['1st','2nd','3rd','4th'])

In [60]:
print(dataframe)

         state  POP
1st    karachi  100
2nd  islamabad  200
3rd    kashmir  300
4th    sialkot  400

In [61]:
#.head() func print first five values 
dataframe.head()

         state  POP
1st    karachi  100
2nd  islamabad  200
3rd    kashmir  300
4th    sialkot  400

In [62]:
dataframe.tail() #tail brings the last values of dataframe

         state  POP
1st    karachi  100
2nd  islamabad  200
3rd    kashmir  300
4th    sialkot  400

In [63]:
#u can also cahnge the position of col
dataframe = pd.DataFrame(dataframe,columns = ['POP','state'])

In [64]:
print(dataframe)

     POP      state
1st  100    karachi
2nd  200  islamabad
3rd  300    kashmir
4th  400    sialkot

In [65]:
#adding a new col :
dataframe = pd.DataFrame(dataframe,columns = ['POP','state','year'])

In [66]:
print(dataframe)

     POP      state  year
1st  100    karachi   NaN
2nd  200  islamabad   NaN
3rd  300    kashmir   NaN
4th  400    sialkot   NaN

In [67]:
dataframe.columns #for printing columns

Index(['POP', 'state', 'year'], dtype='object')

In [68]:
dataframe.index #for printing index of data

Index(['1st', '2nd', '3rd', '4th'], dtype='object')

In [69]:
#a column of a dataframe can be accessed as a series a dict type notation or by an attribute 
#mtlb ap col ko jese dic ko access krty ho usi tarah acces krogy 
dataframe['state'] #dic type

1st      karachi
2nd    islamabad
3rd      kashmir
4th      sialkot
Name: state, dtype: object

In [70]:
#attribute type ":"
dataframe.state

1st      karachi
2nd    islamabad
3rd      kashmir
4th      sialkot
Name: state, dtype: object

In [71]:
#.loc func gives u the data of a particular row
dataframe.loc["3rd"]

POP          300
state    kashmir
year         NaN
Name: 3rd, dtype: object

In [72]:
#for finding no of rows in a data frame :
print(len(dataframe))

4

In [73]:
#for adding values in year col 
#first we calculate the length ;
length = len(dataframe)
print(length)
values = np.arange(length)
dataframe['year'] = values

4

In [74]:
print(dataframe) #values are initialized in the year we can not decrrease or increase the length of the values of year col ,

     POP      state  year
1st  100    karachi     0
2nd  200  islamabad     1
3rd  300    kashmir     2
4th  400    sialkot     3

In [75]:
#inserting new value need to match in length of dataframe

In [76]:
#and if u dont want to pass all the values u can use index no
val = pd.Series([1.1,2.,3.4] , index = ['1st','4th','3rd'])
dataframe ['year'] = val
print(dataframe)

     POP      state  year
1st  100    karachi   1.1
2nd  200  islamabad   NaN
3rd  300    kashmir   3.4
4th  400    sialkot   2.0

In [77]:
dataframe ['year'] =3.5 
print(dataframe)

     POP      state  year
1st  100    karachi   3.5
2nd  200  islamabad   3.5
3rd  300    kashmir   3.5
4th  400    sialkot   3.5

In [78]:
dataframe['year'] = pd.Series([1.5],index = ['2nd'])
print(dataframe)

     POP      state  year
1st  100    karachi   NaN
2nd  200  islamabad   1.5
3rd  300    kashmir   NaN
4th  400    sialkot   NaN

In [79]:
#remember : index length should be equal to value(or do no provide index at all )

# Functions applications and mapping :

In [80]:
#making a data frame
frame =pd.DataFrame(np.random.randn(4,3),columns =list('bde'),
                                                       index = ['utah','ohio','texas','oregon'])
print(frame)

               b         d         e
utah    1.269339 -0.173947 -1.998708
ohio   -1.345161  1.058181 -0.775746
texas   1.144713  1.123848  1.360227
oregon  0.538548 -0.612369  0.409529

In [81]:
#.abs convert all - values to + values :
print(frame['d'].abs())

utah      0.173947
ohio      1.058181
texas     1.123848
oregon    0.612369
Name: d, dtype: float64

In [82]:
#or for all values
print(np.abs(frame))

               b         d         e
utah    1.269339  0.173947  1.998708
ohio    1.345161  1.058181  0.775746
texas   1.144713  1.123848  1.360227
oregon  0.538548  0.612369  0.409529

In [83]:
print(frame['d'].min()) #for finding minimum value

-0.6123685079651073

In [84]:
print(frame['d'].max()) #for finding maximum value

1.1238475584501448

In [85]:
print(frame['d'].max() - frame['d'].min()) #for finding maximum - minimum value

1.7362160664152522

In [86]:
#making a unnamed function using lambda :
f = lambda x : x.max() - x.min()
#applying this function on frame (dataframe) that we had made :
print('\n',frame)
df = frame.apply(f)
print(df ,type(df))
#this function is getting data column wise and calculating max and min value of each column into x and storing it in F varfunc and then applying on frame and printing it .

                b         d         e
utah    1.269339 -0.173947 -1.998708
ohio   -1.345161  1.058181 -0.775746
texas   1.144713  1.123848  1.360227
oregon  0.538548 -0.612369  0.409529
b    2.614500
d    1.736216
e    3.358936
dtype: float64 <class 'pandas.core.series.Series'>

In [87]:
#similary we can do it for rows also by just changing the axis = 1 
df = frame.apply(f,axis =1)
print(df,type(df))
# u can see in the output that its a series type object . because it has only one col :)

utah      3.268047
ohio      2.403342
texas     0.236380
oregon    1.150917
dtype: float64 <class 'pandas.core.series.Series'>

In [88]:
#we can also do the same work like we do in python func:
def f(x):
    minimum = x.min()
    maximum = x.max()
    return pd.Series([maximum,minimum] ,index = ['min','max'])
#applying the func on data frame :and passing dataframe as an argument
df = frame.apply(f)
print(df,type(df))
#as u can see the return object is a data frame not a series because there are more than one col in the output.

            b         d         e
min  1.269339  1.123848  1.360227
max -1.345161 -0.612369 -1.998708 <class 'pandas.core.frame.DataFrame'>

In [89]:
#u can also do it directly withour storing it in a var :
def f(x):
    return pd.Series([x.max(), x.min()] ,index = ['min','max'])

df = frame.apply(f)
print(df,type(df))

            b         d         e
min  1.269339  1.123848  1.360227
max -1.345161 -0.612369 -1.998708 <class 'pandas.core.frame.DataFrame'>

In [90]:
#Sorting and Ranking :
df = pd.DataFrame(np.arange(8).reshape(2,4),index = ['three' ,'one'],columns = ['d','a','b','c'])
print(df)

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [91]:
df.sort_index() #sorting values according to their index

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [92]:
df.sort_index(axis = 1 ,ascending = False) #sorting values using their col and in descending order

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [93]:
#in sort function default are : axis = 0 , ascending = True 
#now sorting by values
df.sort_values(by = 'd'  , ascending = False) #here by shows u how to sort if u pass a col it would sort it according to col

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [94]:
# u can't sort it 'by = row name'  , it would give error

In [95]:
#ranking : means what data would come first and then next and next ....
print(df.rank(ascending = False ,method = 'max') )

         d    a    b    c
three  2.0  2.0  2.0  2.0
one    1.0  1.0  1.0  1.0

In [96]:
print(df.rank(ascending = False ,method = 'min') )

         d    a    b    c
three  2.0  2.0  2.0  2.0
one    1.0  1.0  1.0  1.0

In [97]:
print(df.rank(axis = 'columns') )

         d    a    b    c
three  1.0  2.0  3.0  4.0
one    1.0  2.0  3.0  4.0

In [98]:
df = pd.DataFrame(np.arange(8).reshape(2,4),index = ['three' ,'one'],columns = ['d','a','b','c'])
print(df)
df.sum() #row wise

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

d     4
a     6
b     8
c    10
dtype: int64

In [99]:
df.sum(axis = 'columns')

three     6
one      22
dtype: int64

In [100]:
#skipna = false basically means include the naN values in n(total no)
#remember : it doesnt effect the sum func but it effects the mean( func )
x = df.mean(axis = 'columns' , skipna =False)

In [101]:
print(x)

three    1.5
one      5.5
dtype: float64

In [102]:
#unique values : means the values which are duplicate will only be count once : mean if 1.4 exist three times is data uniques would show it only once.
print(df)

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [103]:
df['d'].unique()

array([0, 4], dtype=int64)

In [104]:
df['b'].value_counts() #count how much time a value is present

6    1
2    1
Name: b, dtype: int64

In [105]:
data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                       index = ['ohio','colorado','utah','newyork'],
                       columns = ['one','two','three','four'])
#The loc() function is used to access a group of rows and columns by label(s) or a boolean array. . loc[] is primarily label based, but may also be used with a boolean array.
print(data_df)
print('\n')
print(data_df.loc['colorado' , ['two','three']])

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
newyork    12   13     14    15


two      5
three    6
Name: colorado, dtype: int32

In [106]:
print(data_df.loc['colorado' ]) # u can't declare col first always declare row first

one      4
two      5
three    6
four     7
Name: colorado, dtype: int32

In [107]:
#if u want to access two or more rows then give it array notation
print(data_df.loc[['colorado' , 'utah' , 'ohio']])

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
ohio        0    1      2     3

In [108]:
#.iloc is same as loc but the major difference is we pass interger value in it 
#instead of name of labels and col
print(data_df.iloc[2,[3,0,1]]) #using index num , slicing is done as this also

four    11
one      8
two      9
Name: utah, dtype: int32

In [109]:
#slcicing :
print(data_df.iloc[1: , 1:3]) # aek kam layega

          two  three
colorado    5      6
utah        9     10
newyork    13     14

In [110]:
print(data_df.iloc[:2])

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

# Arithmetic and data alignment :

In [111]:
#when we add two dataframe they are added by their indexes and col :
df1 = pd.DataFrame(np.arange(9.0).reshape((3,3)),columns = list('bcd'),
                   index = ['ohio','texas','colarado'])
df2 = pd.DataFrame(np.arange(12.0).reshape ((4,3)),
                  columns = list('bde'),
                  index = ['utah' ,'ohio','texas','oregon'])
print(df1)
print(df2)
#applying plus operation between two dataframes :
df3 = df1 +df2
print(f'\n {df3}') #the nan values are because pandas was unable to find their matching index

            b    c    d
ohio      0.0  1.0  2.0
texas     3.0  4.0  5.0
colarado  6.0  7.0  8.0
          b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0

             b   c     d   e
colarado  NaN NaN   NaN NaN
ohio      3.0 NaN   6.0 NaN
oregon    NaN NaN   NaN NaN
texas     9.0 NaN  12.0 NaN
utah      NaN NaN   NaN NaN

In [112]:
#now your work is to fill this nan values with a num 
#choice of num is yours

# Arithmetic method with fill values :
when  we had a problem that index values doesnt match and nan values are created there are some methods form which we can avoid this nan values

In [113]:
#so instead of using + we use add function and fill nan values with a num 
#syntax : dataframe1(dataframe2 , fill_values = any num)
print(df3)
df3 = df1.add(df2 ,fill_value = 0)

print(df3) #there are still some nan values becaise they didnt find any zero to add with.

            b   c     d   e
colarado  NaN NaN   NaN NaN
ohio      3.0 NaN   6.0 NaN
oregon    NaN NaN   NaN NaN
texas     9.0 NaN  12.0 NaN
utah      NaN NaN   NaN NaN
            b    c     d     e
colarado  6.0  7.0   8.0   NaN
ohio      3.0  1.0   6.0   5.0
oregon    9.0  NaN  10.0  11.0
texas     9.0  4.0  12.0   8.0
utah      0.0  NaN   1.0   2.0

# Operations b/w dataframe and series:

In [114]:
print('using new series \n ------------')
series = pd.Series([1,2,3],index =  list('bde'))
print(series.index , series.values)
frame = pd.DataFrame(np.arange(12.0).reshape ((4,3)),
                  columns = list('bde'),
                  index = ['utah' ,'ohio','texas','oregon'])
print(f'\n {frame}')
print(frame - series) #remember indexes should be same :

using new series
 ------------
Index(['b', 'd', 'e'], dtype='object') [1 2 3]

           b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0
          b    d    e
utah   -1.0 -1.0 -1.0
ohio    2.0  2.0  2.0
texas   5.0  5.0  5.0
oregon  8.0  8.0  8.0

In [115]:
#each value of series would be done row wise 
#means dataframes columns name will be match with series index 
#because its row wise broadcasting operation

In [116]:
# columns name can be changed using reindex method :
states = pd.DataFrame(np.arange(9).reshape(3,3),
                     index = ['a','c','d']
                     ,columns = ['ohio','texas','california'])
print(states)
newname = ['texas','utah','california','ohio']
states = states.reindex(columns = newname)
print(states)

   ohio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8
   texas  utah  california  ohio
a      1   NaN           2     0
c      4   NaN           5     3
d      7   NaN           8     6

# Deleting data(row or column from data )

In [117]:
df = pd.DataFrame(np.arange(16).reshape((4,4)),
                       index = ['ohio','colorado','utah','newyork'],
                       columns = ['one','two','three','four'])
print(df,'\n')
#dataframe.drop() method would return  a new dataframe without having deleted rows
#so store it into a dataframe var or use inplace = True while droping rows or columns
#inplace = True means the values would be deleted permenantly 
df.drop(['colorado','ohio'],inplace = True )
print(df)

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
newyork    12   13     14    15

         one  two  three  four
utah       8    9     10    11
newyork   12   13     14    15

In [118]:
# u can also drop values using column by passing 
#axis =1 or axis = columns 
print(df.drop('two',axis = 1))

         one  three  four
utah       8     10    11
newyork   12     14    15

In [119]:
#delete newyork task :
print(df.drop(['newyork']))
print(df) #if inplace = False

      one  two  three  four
utah    8    9     10    11
         one  two  three  four
utah       8    9     10    11
newyork   12   13     14    15

In [120]:
print(df.drop(['newyork'],inplace = True ))
print(df) #if inplace = True

None
      one  two  three  four
utah    8    9     10    11

# indexing , selection and filtering :

In [121]:
df = pd.DataFrame(np.arange(16).reshape((4,4)),
                       index = ['ohio','colorado','utah','newyork'],
                       columns = ['one','two','three','four'])
print(df)
print(df[['one','three']]) #printing two columns

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
newyork    12   13     14    15
          one  three
ohio        0      2
colorado    4      6
utah        8     10
newyork    12     14

In [122]:
#selecting rows like numpy 
df[2:]

         one  two  three  four
utah       8    9     10    11
newyork   12   13     14    15

In [123]:
#re-index method :
obj = pd.Series(['blue','purple','yellow'],
               index = [0,3,6])
print(obj)
obj = obj.reindex(range(9),method = 'ffill') #it would ffill the values
print('\n' ,obj)

0      blue
3    purple
6    yellow
dtype: object

 0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

In [124]:
obj = obj.reindex(range(9),method = 'bfill') #it would backwardfill the values
print('\n' ,obj)

 0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

In [125]:
obj.reindex(range(0,14),method = 'bfill') #remember backward fill does'nt not go for changing the end values

0       blue
1       blue
2       blue
3     purple
4     purple
5     purple
6     yellow
7     yellow
8     yellow
9        NaN
10       NaN
11       NaN
12       NaN
13       NaN
dtype: object

In [126]:
#remember : reindex is a method of a data frame and it has a parameter which name is 'method' and ffill is used to fill nan values

# Selection with loc and iloc :

In [127]:
df = pd.DataFrame(np.arange(16).reshape((4,4)),
                       index = ['ohio','colorado','utah','newyork'],
                       columns = ['one','two','three','four'])
print('\n',df , '\n')
print(df.one[:2])

           one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
newyork    12   13     14    15

ohio        0
colorado    4
Name: one, dtype: int32

In [128]:
#conditional selection 

print(df[df['three']>5]) #it would get all col data

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
newyork    12   13     14    15

In [129]:
#if we want to get the data of a particular col :
print(df.three[df['three']>5]) #it would get the data of only 3 col

colorado     6
utah        10
newyork     14
Name: three, dtype: int32

In [130]:
df['three']>5

ohio        False
colorado     True
utah         True
newyork      True
Name: three, dtype: bool

In [131]:
#in loc method we specify row labels and then column names not integers 
#in iloc method we use row integer indexes and then column integer indexes not names
data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                       index = ['ohio','colorado','utah','newyork'],
                       columns = ['one','two','three','four'])
#The loc() function is used to access a group of rows and columns by label(s) or a boolean array. . loc[] is primarily label based, but may also be used with a boolean array.
print(data_df)
print('\n')
print(data_df.loc['colorado' , ['two','three']])
print(data_df.loc['colorado' ]) # u cant declare col first always declare row(index) first
#if u want to access two or more rows then give it array notation
print(data_df.loc[['colorado' , 'utah' , 'ohio']])
#.iloc is same as loc but the major difference is we pass interger value in it 
#instead of name of labels and col
print(data_df.iloc[2,[3,0,1]]) #using index num , slicing is done same as this 
#slcicing :
print(data_df.iloc[1: , 1:3]) # aek kam layega 
#slcicing :
print(data_df.iloc[1: , 1:3]) # aek kam layega

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
newyork    12   13     14    15


two      5
three    6
Name: colorado, dtype: int32
one      4
two      5
three    6
four     7
Name: colorado, dtype: int32
          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
ohio        0    1      2     3
four    11
one      8
two      9
Name: utah, dtype: int32
          two  three
colorado    5      6
utah        9     10
newyork    13     14
          two  three
colorado    5      6
utah        9     10
newyork    13     14

# Data Loading , Storage, and File Formats :

 - in this we would learn how we can get the data from other sources 

 - the good thing about that is that most of the sources have data in text format

 - (checking a data is in text format or not ) ?if a data can be opened bt notepad or other simple txt opener so it means that data is in in text format .


 - in csv format data comma wise alag hota hai .
 - tabluar ya table format me tab ke zrye data alag hota hai 
 - html me tag se alag alag hota hai 

 - read_csv : used for loading comma delimeted data from a file , url or file like object , ... use comma as default delimeter
 
 -  note : we can use many delimeters except comma in csv.

 - read_excel :  used to read tabluar data from an Excel xls or xlsx file 

 - read_html : used to read all tables found in the given html document .

# Common options in these functions :
- indexing : for getting columns etc 

 - Type interference and conversion : To check data types and conversion and custom list of missing value markers .

 - DateTime Parsing : support of iterating over chunks of very large file bare data ko chote chote chunks me divide krna 
 
  - Unclean Data Issues : Skipping rows or a footer , comments or other minor things like numeric data with thousands seperated by commas .(kuch data hatane ke lye )

# 3 . Loading Data From A CSV File :

In [132]:
sample_df = pd.read_csv("E:/desktop_material/Ai/Pandas-/Sample.csv")

In [133]:
print(sample_df)

  Student_id             Name  Chemistry Physics English Math
0        A01         Airf Ali         10      45      54   54
1        A02      Kamran Khan         20      31      54  foo
2        A03        Imran Ali         30      45      54   45
3        A04      Kashif khan         40      54      Na   65
4        A05    Anees Hussain         46      Na       2   87
5        A06  Ahtisham ud din         87      78      15   95

In [134]:
sample_df = pd.read_csv("E:/desktop_material/Ai/Pandas-/Sample.csv" , names = ["id","name","chem","phy","eng","math"])
#changing the columns names (labels)
print(sample_df) #problem : making the excel column names a data at 0 index to remove this problem 
#use skiprow = index_no

           id             name       chem      phy      eng  math
0  Student_id             Name  Chemistry  Physics  English  Math
1         A01         Airf Ali         10       45       54    54
2         A02      Kamran Khan         20       31       54   foo
3         A03        Imran Ali         30       45       54    45
4         A04      Kashif khan         40       54       Na    65
5         A05    Anees Hussain         46       Na        2    87
6         A06  Ahtisham ud din         87       78       15    95

In [135]:
sample_df = pd.read_csv("E:/desktop_material/Ai/Pandas-/Sample.csv" ,skiprows = 1 , names = ["id","name","chem","phy","eng","math"])
print(sample_df)

    id             name  chem phy eng math
0  A01         Airf Ali    10  45  54   54
1  A02      Kamran Khan    20  31  54  foo
2  A03        Imran Ali    30  45  54   45
3  A04      Kashif khan    40  54  Na   65
4  A05    Anees Hussain    46  Na   2   87
5  A06  Ahtisham ud din    87  78  15   95

# Hierarchal index :

In [136]:
s2_df = pd.read_csv("E:/desktop_material/Ai/Pandas-/ex1.csv")
print(s2_df)

   Unnamed: 0  b   c   d   e message
0           0  1   2   3   4    hello
1           1  5   6   7   8    world
2           2  9  10  11  12      foo

In [137]:
#to make column values as an index values use index_col and it is hierarichal because u can have multiple columns as an index values 
s2_df = pd.read_csv("E:/desktop_material/Ai/Pandas-/ex1.csv" , index_col = ["b","c"])

In [138]:
print(s2_df) #b and c are index now

      Unnamed: 0   d   e message
b c
1 2            0   3   4    hello
5 6            1   7   8    world
9 10           2  11  12      foo

# handling missing values :
it is a very important thing to handle the missing values ...
 - isme ap un value ko bhi handle krty ho jo NaN to nhi hoti pr kisi kam ki nhi hoti yani fill to hogi pr NaN hi hogi aek tarah se for ex : NaN ki jagah not apllicable likh de koi waghera

In [139]:
#to remove a not applicable values make a dic and passs the dic in na_values 
#this process is called sentinals 
sample_df = pd.read_csv("E:/desktop_material/Ai/Pandas-/Sample.csv" ,skiprows = 1 , names = ["id","name","chem","phy","eng","math"])
print(sample_df)

    id             name  chem phy eng math
0  A01         Airf Ali    10  45  54   54
1  A02      Kamran Khan    20  31  54  foo
2  A03        Imran Ali    30  45  54   45
3  A04      Kashif khan    40  54  Na   65
4  A05    Anees Hussain    46  Na   2   87
5  A06  Ahtisham ud din    87  78  15   95

In [140]:
sentinals = {"`Math" : ["foo" , "NA"]}

In [141]:
pd.read_csv("E:/desktop_material/Ai/Pandas-/Sample.csv" , na_values = sentinals)

  Student_id             Name  Chemistry Physics English Math
0        A01         Airf Ali         10      45      54   54
1        A02      Kamran Khan         20      31      54  foo
2        A03        Imran Ali         30      45      54   45
3        A04      Kashif khan         40      54      Na   65
4        A05    Anees Hussain         46      Na       2   87
5        A06  Ahtisham ud din         87      78      15   95

# reading text files in pieces : Table 6-2

# Saving data into a csv file : to_csv

In [142]:
#to_csv is used to save data of a file or output into csv format :
import numpy as np

dates = pd.date_range('1/1/2000' ,periods = 8) 
#date range func is used to create dates and periods define how much dates u need to make .
ts = pd.Series(np.arange(8), index = dates)
print(ts)
ts.to_csv('tseries_2.csv')

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
2000-01-08    7
Freq: D, dtype: int32

C:\Users\Ahtis\Anaconda3\lib\site-packages\ipykernel_launcher.py:8: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.

In [143]:
#to save this this ts output 
print(ts)
ts.to_csv('tseries.csv')

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
2000-01-08    7
Freq: D, dtype: int32

C:\Users\Ahtis\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

# working with delimetted formats:

In [144]:
import csv
file = open('sample.csv')
reader = csv.reader(file)
for line in reader :
    print(line)

['ï»¿Student_id', 'Name', 'Chemistry', 'Physics', 'English', 'Math']
['A01', 'Airf Ali', '10', '45', '54', '54']
['A02', 'Kamran Khan', '20', '31', '54', 'foo']
['A03', 'Imran Ali', '30', '45', '54', '45']
['A04', 'Kashif khan', '40', '54', 'Na', '65']
['A05', 'Anees Hussain', '46', 'Na', '2', '87']
['A06', 'Ahtisham ud din', '87', '78', '15', '95']

# json data :
 -  u can read json data in pandas by using pd.read_json('filename')
 - json means : java Script Object Notation 
 - json data is in the form same like dictionary

In [145]:
#pd.read_json is used to read json files and convert them in dataframe from json format

# xml and html (web data loading) :

In [146]:
#read_html read data of table tag from a html file or url 
tables = pd.read_html("https://www.fdic.gov/bank/individual/failed/banklist.html")
#but table varibale type is not dataframe its list so
print(type(tables))
print(len(tables))

<class 'list'>
1

In [147]:
#as u can see in output its a list 
#getting 1st element from the list of tables 
lst_bank = tables[0]
print(type(lst_bank))
print(lst_bank.shape) #shape
print(lst_bank.columns) #col names
print(len(lst_bank)) #for len

<class 'pandas.core.frame.DataFrame'>
(561, 6)
Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date'],
      dtype='object')
561

In [148]:
#getting information from col 
lst_bank["City"].head()
lst_bank["Bank Name"].head()

0                The First State Bank
1                  Ericson State Bank
2    City National Bank of New Jersey
3                       Resolute Bank
4               Louisa Community Bank
Name: Bank Name, dtype: object

In [149]:
closingdate = pd.to_datetime(lst_bank['Closing Date'])
#to_datetime is used to convert string date and for getting dates from a web page 
print(type(closingdate))
print(closingdate.tail())

<class 'pandas.core.series.Series'>
556   2001-07-27
557   2001-05-03
558   2001-02-02
559   2000-12-14
560   2000-10-13
Name: Closing Date, dtype: datetime64[ns]

# Binary Data Format :
- It is a data not in human understandable form , it contain value 0s and 1s .
- the best advantage of binary data is it take less space in memory as compared to text data so it is saved and loaded fastly as compared to text data 
- problem : binary data is not portable mtlb ap use aek jagah se dosri jagah move  nhi kr skty wo thora technology specific ya language specific bhi ho skta hai 
 - .to_pickle : used to store data in binary format 
 - pd.read_pickle used to load the stored binary data

In [150]:
bindata = pd.read_csv("ex1.csv")
bindata

   Unnamed: 0  b   c   d   e message
0           0  1   2   3   4    hello
1           1  5   6   7   8    world
2           2  9  10  11  12      foo

In [151]:
#storing in bin format 
bindata.to_pickle("binary data")

In [152]:
#reading binary data and converting it to human understandable form
pd.read_pickle("binary data")

   Unnamed: 0  b   c   d   e message
0           0  1   2   3   4    hello
1           1  5   6   7   8    world
2           2  9  10  11  12      foo

# Using HDF (hierarchical data format ) :
- it is a database structure 
- the best thing of hierarchical format is while loading data from a file or data base u can filter it while loading it in your memory .
- but in html  , csv and other formats u had to load the complete data first in your memory and the u can filter it .

In [153]:
#using HDF% format :
frame = pd.DataFrame({"a" : np.random.randn(100)})
#for making a hdf data base use : pd.HDFStore("file name")
store = pd.HDFStore("hdf_data") 

#saving data in HDF database  : database_name ['data name that u want to keep'] = pass the real data
store['obj'] = frame #u can store complete data frame

store["obj_col"] = frame['a'] # or u can store a single col of a data frame 

print(store) # will tell u the type od store

print(type(store.obj)) #will tell u the type of the obj

print(store.obj.head())

<class 'pandas.io.pytables.HDFStore'>
File path: hdf_data

<class 'pandas.core.frame.DataFrame'>
          a
0 -0.702807
1  1.860084
2  0.837710
3 -0.955058
4  1.490111

In [154]:
#2nd option :
store.put('obj2' , frame , format = "table") #2ND method of making data base 
# benfit of : format = table : using format = table ka fiada ye hai ke ap data ko load krwaty hue filter bhi kr skty hai jo HDF ka sb se bara benefit hai.

#filtering the data while reteriving  : using the condition 

ab = store.select("obj2" , where = ["index >= 15 and index <= 25"])
print(ab)

store.close() # close the data is a good practice other wise your data base may get corrupted

           a
15 -0.093455
16 -0.941141
17 -0.539922
18  0.424693
19  0.416313
20 -0.761845
21  0.289995
22 -0.106905
23 -0.961632
24  0.107993
25 -0.099601

In [155]:
#3Rd option : we had two shorcut funtion for doing this work
#data.to_hdf : for writing and making the data 
#pd.read_hdf : for reading the hdf data from database and filtering 7

frame.to_hdf('mydata.h6', 'obj3' , format = 'table')

frame2 = pd.read_hdf('mydata.h6','obj3' , where =["index<5"])

print(frame2)

          a
0 -0.702807
1  1.860084
2  0.837710
3 -0.955058
4  1.490111

# Microsoft Excel Data :

In [156]:
#READING :
xlsx = pd.ExcelFile("PIAIC Batch 4 Q1 Zoom Timings.xlsx") #loading the file 
frame = pd.read_excel ("PIAIC Batch 4 Q1 Zoom Timings.xlsx" ,"CNC-Saturday") #reading the data

In [157]:
frame.head()

,Roll No,Slot Name,Slot Day,Onsite Class Time,Full Name,Father Name,Zoom Class Timing,Zoom Class Day,Zoom Teacher
0,PIAIC45675,Saylani Welfare,Saturday,12:30 PM to 03:30 PM,subhan ali,zulfqar ali,1:30 PM - 3:30 PM,Saturday,Aamir Pinger
1,PIAIC49795,Saylani Welfare,Saturday,12:30 PM to 03:30 PM,Aamir Shabir,Muhammad Shabbir,1:30 PM - 3:30 PM,Saturday,Aamir Pinger
2,PIAIC50204,Saylani Welfare,Saturday,12:30 PM to 03:30 PM,Usama Atta,Atta ur Rehman,1:30 PM - 3:30 PM,Saturday,Aamir Pinger
3,PIAIC50285,Saylani Welfare,Saturday,12:30 PM to 03:30 PM,Muhammad Kashan,Muhammad Shahid,1:30 PM - 3:30 PM,Saturday,Aamir Pinger
4,PIAIC50329,Saylani Welfare,Saturday,12:30 PM to 03:30 PM,Muhammad Bilal,Tanveer Hussain,1:30 PM - 3:30 PM,Saturday,Aamir Pinger

In [158]:
#writing in excel file :
writer = pd.ExcelWriter("copyingexcel.xlsx") #the file in which u want to write 

frame.to_excel(writer,"CNC-Saturday") #writing in writer from frame file 
writer.save() #saving the file

In [159]:
#alternating option for saving a single sheet excel file 
# filename_from_which data u want to save .to_excel("file_name_in_which u want the data to be saved ")
frame.to_excel("copyingexcel.xlsx")

#  LESSON NO : 04 
# Data Cleaning And Preparation ...

# Handling Missing Data :
 - for numeric data pandas uses the floarting point value NaN(not a number ) to represent missing data 
 -  Sometime the data u get from a source has not NaN values in missing spaces and it can be a string or something else like "not found" , "not available" etc

In [160]:
from numpy import nan as notfound #declaring ke jaha pr notfound likha ho data me use as a null value mark krdo

In [163]:

data = pd.DataFrame([[1,6.5,3.0],
                    [1.0,notfound,notfound],
                    [notfound,notfound,notfound],
                    [notfound,6.5,3.0]],
                    columns = list("abc"))
print(data)
display(data) #the benefit of using display instead of print is u get the data in a descent manner .

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [165]:
#removing NaN values using dropna
cleaned = data.dropna() #dropna function drop all the rows having a single nan value 

cleaned

     a    b    c
0  1.0  6.5  3.0

In [ ]:
#while usiing how = "all" in dropna() then it will delete rows having all nan values
#but wo un rows ko delete ni krega jin me aek bhi not null value hon